MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_22_04/GL050001C0_40_Display.cpp
static void drawSmoothStringCentered(int centerX, int baselineY, const char *text,
                                     uint16_t color, const SmoothFont &font)
{
  drawSmoothString(centerX - smoothTextWidth(text, font) / 2,
                   baselineY, text, color, font);
}

static uint16_t targetColor(uint8_t alarmLevel)
{
  if (alarmLevel >= 3) {
    return COLOR_RED;
  }
  if (alarmLevel == 2) {
    return COLOR_ORANGE;
  }
  if (alarmLevel == 1) {
    return COLOR_WARN;
  }
  return COLOR_TEXT;
}

static void drawBatteryIcon(int x, int y, uint8_t percent, bool valid)
{
  const uint16_t border = valid ? COLOR_TEXT : COLOR_GRID;
  const uint16_t levelColor = !valid ? COLOR_GRID :
                              (percent > 50 ? COLOR_GREEN :
                               (percent > 20 ? COLOR_WARN : COLOR_RED));
  drawRectOutline(x, y, 45, 20, border);
  fillRect(x + 45, y + 6, 4, 8, border);
  // Пять сегментов соответствуют шагу 20%. При 0% все сегменты пусты,
  // при 100% заполнены все пять. Процент рассчитан по диапазону 7...12 В.
  const int segments = valid && percent > 0 ? ((percent + 19) / 20) : 0;
  for (int segment = 0; segment < 5; ++segment) {
    fillRect(x + 4 + segment * 8, y + 4, 6, 12,
             segment < segments ? levelColor : COLOR_SCREEN_BG);
  }
}

static void drawTargetTable()
{
  if (!displayState.tableVisible || displayState.trackerMessageVisible) {
    return;
  }
  static const int columnX[9] = {40, 125, 210, 295, 380, 465, 565, 690, 766};
  static const char *headers[9] = {
    "ICAO", "SQUAWK", "FLIGHT", "ALT", "SPEED",
    "COURSE", "LATITUDE", "LONGITUDE", "SIG"
  };
  for (uint8_t column = 0; column < 9; ++column) {
    drawSmoothStringCentered(columnX[column], 54, headers[column], COLOR_OWN_AIRCRAFT, FONT_TINY);
  }
  drawLine(8, 59, 792, 59, COLOR_OWN_AIRCRAFT);

  // Заголовки являются постоянной частью интерфейса. Без подтверждённого
  // пакета скрываем только строки с принятыми данными самолётов.
  if (!displayState.baseConnected) {
    return;
  }

  const uint8_t rows = displayState.tableTargetCount < 3 ?
                       displayState.tableTargetCount : 3;
  for (uint8_t row = 0; row < rows; ++row) {
    const GL050001C0_40_Target &target = displayState.tableTargets[row];
    const int baseline = 76 + row * 20;
    const uint16_t color = COLOR_OWN_AIRCRAFT;
    char buffer[32];
    snprintf(buffer, sizeof(buffer), "%06lX", (unsigned long)(target.address & 0xFFFFFFUL));
    drawSmoothStringCentered(columnX[0], baseline, buffer, color, FONT_TINY);
    if (target.squawk != 0) {
      snprintf(buffer, sizeof(buffer), "%u", (unsigned)target.squawk);
      drawSmoothStringCentered(columnX[1], baseline, buffer, color, FONT_TINY);
    }
    drawSmoothStringCentered(columnX[2], baseline,
                             target.callsign[0] ? target.callsign : "--------",
                             color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%d", (int)target.altitudeM);
    drawSmoothStringCentered(columnX[3], baseline, buffer, color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%u", (unsigned)target.speedKmh);
    drawSmoothStringCentered(columnX[4], baseline, buffer, color, FONT_TINY);
    snprintf(buffer, sizeof(buffer), "%03u", (unsigned)target.courseDeg);
    drawSmoothStringCentered(columnX[5], baseline, buffer, color, FONT_TINY);
    if (target.latitude != 0.0f)
      snprintf(buffer, sizeof(buffer), "%.5f", target.latitude);
    else
      snprintf(buffer, sizeof(buffer), "---");
    drawSmoothStringCentered(columnX[6], baseline, buffer, color, FONT_TINY);
    if (target.longitude != 0.0f)
      snprintf(buffer, sizeof(buffer), "%.5f", target.longitude);
    else
      snprintf(buffer, sizeof(buffer), "---");
    drawSmoothStringCentered(columnX[7], baseline, buffer, color, FONT_TINY);
    if (target.signalRssi != 0) {
      snprintf(buffer, sizeof(buffer), "%d", (int)target.signalRssi);
    } else {
      snprintf(buffer, sizeof(buffer), "--");
    }
    drawSmoothStringCentered(columnX[8], baseline, buffer, color, FONT_TINY);
  }
}

static uint16_t chooseRadarRangeMeters()
{
  if (displayState.radarRangeM != 0) {
    return displayState.radarRangeM;
  }
  uint32_t nearest = 64000;
  for (uint8_t index = 0; index < displayState.targetCount; ++index) {
    const uint32_t distance = displayState.targets[index].distanceM;
    if (distance > 0 && distance < nearest) {
      nearest = distance;
    }
  }
  if (nearest > 16000) return 32000;
  if (nearest >  8000) return 16000;
  if (nearest >  4000) return  8000;
  if (nearest >  2000) return  4000;
  if (nearest >  1000) return  2000;
  return 1000;
}

enum RadarLabelSide : uint8_t {
  RADAR_LABEL_BELOW = 0,
  RADAR_LABEL_LEFT  = 1,
  RADAR_LABEL_ABOVE = 2,
  RADAR_LABEL_RIGHT = 3
};

struct RadarLabelRect {
  int x;
  int y;
  int width;
  int height;
};

static RadarLabelSide radarLabelSideFromCourse(int courseDeg)
{
  int normalized = courseDeg % 360;
  if (normalized < 0) normalized += 360;
  if (normalized < 45 || normalized >= 315) return RADAR_LABEL_BELOW;
  if (normalized < 135) return RADAR_LABEL_LEFT;
  if (normalized < 225) return RADAR_LABEL_ABOVE;
  return RADAR_LABEL_RIGHT;
}

static bool radarRectsOverlap(const RadarLabelRect &a, const RadarLabelRect &b,
                              int padding)
{
  return !((a.x + a.width + padding) <= b.x ||
           (b.x + b.width + padding) <= a.x ||
           (a.y + a.height + padding) <= b.y ||
           (b.y + b.height + padding) <= a.y);
}

static RadarLabelRect radarLabelCandidate(RadarLabelSide side, int targetX,
                                          int targetY, int width, int height,
                                          int gap)
{
  RadarLabelRect result = {targetX - width / 2, targetY - height / 2,
                           width, height};
  switch (side) {
    case RADAR_LABEL_LEFT:
      result.x = targetX - 8 - gap - width;
      break;
    case RADAR_LABEL_RIGHT:
      result.x = targetX + 8 + gap;
      break;
    case RADAR_LABEL_ABOVE:
      result.y = targetY - 8 - gap - height;
      break;
    case RADAR_LABEL_BELOW:
    default:
      result.y = targetY + 8 + gap;
      break;
  }
  result.x = constrain(result.x, 0, LCD_WIDTH - width);
  result.y = constrain(result.y, 130, LCD_HEIGHT - height);
  return result;
}

static void drawRadar()
{
  static const float DEG_TO_RAD_LOCAL = 0.01745329252f;
  const int centerX = 400;
  const int centerY = 360;
  const int outerRadius = 350;
  const int targetRadius = 336;
  // Без базы сохраняем статическое координатное поле в положении "север
  // вверх". Значения курса и целей из последнего пакета не используем.
  const uint16_t effectiveCourse = displayState.baseConnected ?
                                   displayState.courseDeg : 0U;
  const uint16_t rangeMeters = displayState.baseConnected ?
                               chooseRadarRangeMeters() : 32000U;

  drawCircle(centerX, centerY, 180, COLOR_GRID);
  drawLine(centerX - 8, centerY, centerX + 8, centerY, COLOR_GRID);
  drawLine(centerX, centerY - 8, centerX, centerY + 8, COLOR_GRID);

