MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_Display/DispTFT5.0/Arhiv/FlyRf_Disp_26_07_22_04/GL050001C0_40_Display.cpp
  // Полная замена pushRotated(): шкала компаса математически вращается на
  // отрицательный курс собственного самолёта. Сам самолёт остаётся по центру.
  for (int bearing = 0; bearing < 360; bearing += 10) {
    const float radians = (bearing - (int)effectiveCourse) * DEG_TO_RAD_LOCAL;
    const int outerX = centerX + (int)lroundf(sinf(radians) * outerRadius);
    const int outerY = centerY - (int)lroundf(cosf(radians) * outerRadius);
    const int tickLength = (bearing % 30 == 0) ? 14 : 6;
    const int innerX = centerX + (int)lroundf(sinf(radians) * (outerRadius - tickLength));
    const int innerY = centerY - (int)lroundf(cosf(radians) * (outerRadius - tickLength));
    drawLine(innerX, innerY, outerX, outerY, COLOR_GRID);
  }

  static const char *cardinalText[4] = {"N", "E", "S", "W"};
  static const int cardinalBearing[4] = {0, 90, 180, 270};
  for (int cardinal = 0; cardinal < 4; ++cardinal) {
    const float radians = (cardinalBearing[cardinal] - (int)effectiveCourse) *
                          DEG_TO_RAD_LOCAL;
    const int labelRadius = outerRadius - 25;
    const int labelX = centerX + (int)lroundf(sinf(radians) * labelRadius);
    const int labelY = centerY - (int)lroundf(cosf(radians) * labelRadius) + 8;
    drawSmoothStringCentered(labelX, labelY, cardinalText[cardinal],
                             COLOR_GRID, FONT_MEDIUM);
  }

  drawLine(centerX - 1, centerY - 15, centerX - 1, centerY + 12, COLOR_OWN_AIRCRAFT);
  drawLine(centerX, centerY - 15, centerX, centerY + 12, COLOR_OWN_AIRCRAFT);
  drawLine(centerX + 1, centerY - 15, centerX + 1, centerY + 12, COLOR_OWN_AIRCRAFT);
  drawLine(centerX - 14, centerY - 3, centerX + 12, centerY - 3, COLOR_OWN_AIRCRAFT);
  drawLine(centerX - 18, centerY - 1, centerX + 17, centerY - 1, COLOR_OWN_AIRCRAFT);
  drawLine(centerX - 8, centerY + 12, centerX + 8, centerY + 12, COLOR_OWN_AIRCRAFT);

  char rangeText[20];
  snprintf(rangeText, sizeof(rangeText), "%u km", (unsigned)(rangeMeters / 1000));
  // Исходная рамка (216,302,56,17), масштаб 1,5 и горизонтальное поле 40 px.
  drawRectOutline(364, 453, 84, 26, COLOR_RED);
  drawSmoothStringCentered(406, 473, rangeText, COLOR_TEXT, FONT_SMALL);

  // Круги, шкала, стороны света, собственный самолёт и надпись дальности
  // остаются. Ни одна цель из устаревшего RS485-пакета не выводится.
  if (!displayState.baseConnected) {
    return;
  }

  RadarLabelRect placedLabels[GL050001C0_40_MAX_TARGETS] = {};
  int placedTargetX[GL050001C0_40_MAX_TARGETS] = {};
  int placedTargetY[GL050001C0_40_MAX_TARGETS] = {};
  uint8_t placedCount = 0;

  for (uint8_t index = 0; index < displayState.targetCount; ++index) {
    const GL050001C0_40_Target &target = displayState.targets[index];
    const uint32_t maxVisibleMeters = (uint32_t)rangeMeters * 2U;
    if (target.distanceM == 0 || target.distanceM > maxVisibleMeters) {
      continue;
    }
    const float relativeAngle = ((int)target.bearingDeg - (int)effectiveCourse) * DEG_TO_RAD_LOCAL;
    float radius;
    if (target.distanceM <= rangeMeters) {
      radius = ((float)target.distanceM * 180.0f) / rangeMeters;
    } else {
      radius = 180.0f + ((float)(target.distanceM - rangeMeters) *
                         (targetRadius - 180.0f)) / rangeMeters;
    }
    const int x = centerX + (int)lroundf(sinf(relativeAngle) * radius);
    const int y = centerY - (int)lroundf(cosf(relativeAngle) * radius);
    // Таблица занимает верхнюю часть экрана. Цели, попавшие за её границу,
    // не рисуем поверх заголовков и не включаем в частичную радарную область.
    if (y < 130) {
      continue;
    }
    const uint16_t color = targetColor(target.alarmLevel);
    // Диаметр символа цели уменьшен примерно на 25%: радиус 10 -> 8 px.
    fillCircle(x, y, 8, color);
    const float courseAngle = ((int)target.courseDeg - (int)effectiveCourse) * DEG_TO_RAD_LOCAL;
    const int courseX = x + (int)lroundf(sinf(courseAngle) * 30);
    const int courseY = y - (int)lroundf(cosf(courseAngle) * 30);
    drawLine3px(x, y, courseX, courseY, color);
    char label[20];
    snprintf(label, sizeof(label), "%+d", (int)target.relativeAltitudeM);
    const bool hasArrow = target.verticalRate != 0;
    const int textWidth = smoothTextWidth(label, FONT_SMALL);
    const int groupWidth = textWidth + (hasArrow ? 17 : 0);
    const int labelBlockWidth = max(58, groupWidth + 4);
    const int labelBlockHeight = 24;
    const int relativeCourse = ((int)target.courseDeg - (int)effectiveCourse + 360) % 360;
    const RadarLabelSide preferredSide = radarLabelSideFromCourse(relativeCourse);
    const RadarLabelSide sideOrder[4] = {
      preferredSide,
      (RadarLabelSide)((preferredSide + 1U) & 3U),
      (RadarLabelSide)((preferredSide + 3U) & 3U),
      (RadarLabelSide)((preferredSide + 2U) & 3U)
    };
    static const int gapVariants[] = {4, 10, 16, 22, 28};
    RadarLabelRect labelRect = radarLabelCandidate(preferredSide, x, y,
                                                   labelBlockWidth,
                                                   labelBlockHeight, 4);
    RadarLabelSide selectedSide = preferredSide;
    bool positionFound = false;
    for (uint8_t sideIndex = 0; sideIndex < 4 && !positionFound; ++sideIndex) {
      for (uint8_t gapIndex = 0; gapIndex < sizeof(gapVariants) / sizeof(gapVariants[0]); ++gapIndex) {
        const RadarLabelRect candidate = radarLabelCandidate(
          sideOrder[sideIndex], x, y, labelBlockWidth, labelBlockHeight,
          gapVariants[gapIndex]);
        bool overlaps = false;
        for (uint8_t placed = 0; placed < placedCount && !overlaps; ++placed) {
          overlaps = radarRectsOverlap(candidate, placedLabels[placed], 3);
          const RadarLabelRect symbolArea = {placedTargetX[placed] - 18,
                                             placedTargetY[placed] - 18,
                                             36, 36};
          overlaps = overlaps || radarRectsOverlap(candidate, symbolArea, 0);
        }
        if (!overlaps) {
          labelRect = candidate;
          selectedSide = sideOrder[sideIndex];
          positionFound = true;
          break;
        }
      }
    }

    // Слева от цели вся группа выравнивается по правому краю формуляра.
    // На остальных сторонах она начинается от левого края, как в исходнике.
    const int labelX = selectedSide == RADAR_LABEL_LEFT ?
      labelRect.x + labelRect.width - groupWidth - 1 : labelRect.x + 2;
    const int labelBaselineY = labelRect.y + 20;
    drawSmoothString(labelX, labelBaselineY, label, color, FONT_SMALL);

    // Как в исходном проекте: стрелка начинается после последней цифры
    // формуляра, а не в фиксированной позиции относительно символа цели.
    const int arrowX = labelX + smoothTextWidth(label, FONT_SMALL) + 5;
    const int arrowTopY = labelBaselineY - 17;
    const int arrowBottomY = labelBaselineY + 1;
    if (target.verticalRate > 0) {
      drawArrowLine(arrowX, arrowBottomY, arrowX, arrowTopY, color);
      drawArrowLine(arrowX, arrowTopY, arrowX - 5, arrowTopY + 6, color);
      drawArrowLine(arrowX, arrowTopY, arrowX + 5, arrowTopY + 6, color);
    } else if (target.verticalRate < 0) {
      drawArrowLine(arrowX, arrowTopY, arrowX, arrowBottomY, color);
      drawArrowLine(arrowX, arrowBottomY, arrowX - 5, arrowBottomY - 6, color);
      drawArrowLine(arrowX, arrowBottomY, arrowX + 5, arrowBottomY - 6, color);
    }

    if (placedCount < GL050001C0_40_MAX_TARGETS) {
      placedLabels[placedCount] = labelRect;
      placedTargetX[placedCount] = x;
      placedTargetY[placedCount] = y;
      ++placedCount;
    }
  }
}

